;EA交易单独测试: 华尔街高级量化架构师定制 - 黄金顺势对冲系统, XAUUSD H1, 真实报价, 2020.01.01 - 2026.04.18
[Tester]
Expert=华尔街高级量化架构师定制 - 黄金顺势对冲系统.ex5
Symbol=XAUUSD
Period=H1
Optimization=0
Model=4
FromDate=2020.01.01
ToDate=2026.04.18
ForwardMode=0
Deposit=20000
Currency=USD
ProfitInPips=0
Leverage=200
ExecutionMode=100
OptimizationCriterion=7
Visual=0
[TesterInputs]
; === 资金管理与手数 ===
InpUseDynamicLot=false||false||0||true||N
InpFixedLotSize=0.5||0.5||0.050000||5.000000||N
InpMaxRiskPerTrade=1||1.0||0.100000||10.000000||N
InpMaxDailyDrawdown=5||5.0||0.500000||50.000000||N
InpMaxConsecutiveLoss=3||3||1||30||N
InpMaxPositions=3||6||1||60||N
; === 智能保本与追踪防线 (V4核心) ===
InpUseBreakEven=true||false||0||true||N
InpBreakEvenTrigger=1400||500.0||100.0||2000.0||Y
InpBreakEvenProfit=150||150.0||15.000000||1500.000000||N
InpUseTrailing=true||false||0||true||N
InpTrailingDistance=2900||1000.0||100.0||3000.0||Y
InpTrailingStep=300||300.0||30.000000||3000.000000||N
; === 趋势与震荡过滤引擎 ===
InpEmaFast=50||50||1||500||N
InpEmaSlow=200||200||1||2000||N
InpAdxPeriod=14||14||1||140||N
InpAdxThreshold=20||20.0||1.0||40.0||Y
InpColorLongZone=8388608
InpColorShortZone=128
; === ATR加仓与物理防线 ===
InpAtrPeriod=14||14||1||140||N
InpAtrMultiplier=2.5||0.5||0.1||2.5||Y
InpLotMultiplier=0.8||0.8||0.080000||8.000000||N
InpStopLossPoints=1500||3000.0||300.000000||30000.000000||N
InpTakeProfitPoints=5000||5000.0||500.000000||50000.000000||N
; === 动态对冲极速解套参数 ===
InpHedgeCoverage=1.02||1.15||0.115000||11.500000||N
InpSameSideLockProfit=200||100.0||10.000000||1000.000000||N
; === 环境与时段过滤 ===
InpMaxSpread=80||40||1||400||N
InpCloseOnFriday=true||false||0||true||N
InpFridayCloseHour=21||21||1||210||N
